%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up


Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface FastEthernet0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet1/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet1/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet0/0
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet4/0
Router(config-if)#ip address 172.17.0.1 255.255.0.0
Router(config-if)#ip address 172.17.0.1 255.255.0.0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet4/0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet4/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet4/0, changed state to up

Router(config-if)#exit
Router(config)#interface FastEthernet5/0
Router(config-if)#ip address 172.18.0.1 255.255.0.0
Router(config-if)#ip address 172.18.0.1 255.255.0.0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet5/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet5/0, changed state to up

Router(config-if)#exit
Router(config)#interface FastEthernet5/0
Router(config-if)#








Router con0 is now available






Press RETURN to get started.













Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#
Router(config)#router rip
Router(config-router)#
Router(config-router)#end
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#
%SYS-5-CONFIG_I: Configured from console by console









Router con0 is now available






Press RETURN to get started.












%LINK-3-UPDOWN: Interface FastEthernet5/0, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet5/0, changed state to down

%LINK-5-CHANGED: Interface FastEthernet5/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet5/0, changed state to up


Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface FastEthernet1/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet4/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet5/0
Router(config-if)#








Router con0 is now available






Press RETURN to get started.












%LINK-3-UPDOWN: Interface FastEthernet4/0, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet4/0, changed state to down

%LINK-5-CHANGED: Interface FastEthernet4/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet4/0, changed state to up


Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#ip route 192.168.1.0 255.255.255.0 172.17.0.2
Router(config)#ip route 192.168.3.0 255.255.255.0 172.18.0.2
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console
wr
Building configuration...
[OK]
Router#
Router#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
Router#