Router(config)#interface FastEthernet0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet4/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet5/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet4/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet5/0
Router(config-if)#wr
                  ^
% Invalid input detected at '^' marker.
	
Router(config-if)#exit
Router(config)#wr
               ^
% Invalid input detected at '^' marker.
	
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console
wr
Building configuration...
[OK]
Router#
%LINK-3-UPDOWN: Interface FastEthernet4/0, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet4/0, changed state to down









Router con0 is now available






Press RETURN to get started.












%LINK-5-CHANGED: Interface FastEthernet4/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet4/0, changed state to up


Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface FastEthernet1/0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet1/0, changed state to up
shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet1/0, changed state to administratively down

Router(config-if)#exit
Router(config)#interface FastEthernet0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet4/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet5/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet5/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet4/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet5/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet4/0
Router(config-if)#
Router(config-if)#exit
Router(config)#
Router(config)#
Router(config)#
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console
sh ip ro
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

C    172.16.0.0/16 is directly connected, FastEthernet5/0
C    172.18.0.0/16 is directly connected, FastEthernet4/0
S    192.168.1.0/24 [1/0] via 172.16.0.2
S    192.168.2.0/24 [1/0] via 172.18.0.1
C    192.168.3.0/24 is directly connected, FastEthernet0/0

Router#








Router con0 is now available






Press RETURN to get started.













Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface FastEthernet5/0
Router(config-if)#
%LINK-3-UPDOWN: Interface FastEthernet5/0, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet5/0, changed state to down

%LINK-5-CHANGED: Interface FastEthernet5/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet5/0, changed state to up

Router(config-if)#exit
Router(config)#
Router(config)#no ip route 192.168.2.0 255.255.255.0 172.18.0.1
Router(config)#
Router(config)#end
Router#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#
Router(config)#
Router(config)#ip route 192.168.2.0 255.255.255.0 172.18.0.1
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console
wr
Building configuration...
[OK]
Router#
Router#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
Router#